Public Attributes | List of all members
API_WindowType Struct Reference
Element Manager
Represents a window element. More...
#include <APIdefs_Elements.h>
 Public Attributes
 API_Elem_Head  | head
General element header.
 API_OpeningBaseType  | openingBase
Common part of windows, doors and skylights (see API_OpeningBaseType).
 API_WindowDoorRevealDepthLocationID  | revealDepthLocation
The location of the reveal depth reference line. | APIWDRevealDepth_Side | The reference line location is on the clicked side of the wall. | | APIWDRevealDepth_Core | The reference line location is on the core (clicked side) skin of the composite structure. |.
 double  | revealDepthOffset
Inset from the clicked side of wall or core (according to revealDepthLocation).
 double  | revealDepthFromSide
Calculated inset from the clicked side of wall.
 double  | jambDepthHead
Inset on top.
 double  | jambDepthSill
Inset on bottom.
 double  | jambDepth
Inset on left.
 double  | jambDepth2
Inset on right.
 bool  | reveal
True if the opening has reveal.
 API_Guid  | owner
Reference to the container wall (see API_Guid).
 double  | objLoc
Location of the center of the window. If the container wall is polygonal, this value is not used.
 double  | lower
Parapet height.
 API_Coord  | startPoint
The location of the center point of the opening. It is measured from the beginning corner of the wall roof etc., rotated into the direction of the wall reference edge starting from the first corner. Note that this location can be outside of the wall polygon.
 API_Coord  | dirVector
The direction vector of the opening in a polygonal wall, relative to the wall reference edge starting from the first corner.
API_WindowDoorDirectionTypes  | directionType
Type of the plane orientation of the window placed into slanted wall.
 short  | fixPoint
The fixed (placement) point of the window (relative to the owning wall's reference line): | APIHoleAnchor_BegFix | Beginning point is fixed. | | APIHoleAnchor_CenterFixCenter | Center point is fixed. | | APIHoleAnchor_EndFixEnd | End point is fixed. |.
Detailed Description
Represents a window element.
Remarks
For window related memo data see the ACAPI_Element_GetMemo function. See also API_DoorType.
Member Data Documentation
◆ directionType
 API_WindowType::directionType
Type of the plane orientation of the window placed into slanted wall.
 Direction type  | Meaning
 API_WDAssociativeToWall  | The plane of the window follows the plane of the wall
 API_WDVertical  | The window is placed vertically regardless of the plane of the wall it is placed into